[
 
   {
     "id": "/the-recruitment-threesome",
     "title": "The recruitment threesome",
     "url": "http://barryfrost.com/articles/the-recruitment-threesome",
     "posted": "2011-05-25T22:32:00+01:00",
     "summary": "An employer, a candidate and a recruiter. Sometimes recruitment is direct, but often it involves each of the three parties...",
     "body": "&lt;p&gt;An employer, a candidate and a recruiter. Sometimes recruitment is direct, but often it involves each of the three parties jumping into bed together. Despite early enthusiasm the end result can frequently be disappointing and unsatisfying. It doesn&amp;#8217;t have to be this way.&lt;/p&gt;&lt;p&gt;OK, weak, smutty analogy over&amp;#8230; This post offers advice and a few pointers from an employer&amp;#8217;s perspective to recruiters and candidates on how to make the process a little easier.&lt;/p&gt;&lt;p&gt;I&amp;#8217;ve hired dozens of developers, engineers, designers, project managers and testers and although my experience is in the web industry in the UK, the advice should apply elsewhere.&lt;/p&gt;&lt;p&gt;What are we doing wrong?&lt;/p&gt;&lt;h2 id='recruiters'&gt;Recruiters&lt;/h2&gt;&lt;p&gt;I&amp;#8217;ve had the misfortune of dealing with some terrible recruiters over the last few years. One sent candidates to the wrong address for interviews on two separate occasions. Another invited me to apply for a job I was advertising with her. Another threatened to poach my developers for his other clients in retaliation for not agreeing to work with him. Classy.&lt;/p&gt;&lt;p&gt;There have been exceptions, but as a rule I&amp;#8217;m usually more frustrated than happy with the service I&amp;#8217;ve received. Here&amp;#8217;s what would bring a smile to my face.&lt;/p&gt;&lt;h3 id='match_dont_splattergun'&gt;Match, don&amp;#8217;t splattergun&lt;/h3&gt;&lt;p&gt;We&amp;#8217;re paying for your skill and expertise in search and selection, not your ability to keyword mine on LinkedIn. Please don&amp;#8217;t just trawl Monster.com, forward a bunch of CVs and hope one sticks. Listen, understand and head-hunt the hidden gems.&lt;/p&gt;&lt;p&gt;Read the job specifications that I&amp;#8217;ve taken the time to write. Read our website and understand what we do. Find out what our team culture is like. Ask questions and I&amp;#8217;ll answer them.&lt;/p&gt;&lt;p&gt;If you can demonstrate you can carefully match a candidate with our company/team culture &lt;strong&gt;and&lt;/strong&gt; the skills/requirements of the role then I will cherish you and use you again and again and again. Splattergun me with a succession of duff CVs and I&amp;#8217;ll go elsewhere.&lt;/p&gt;&lt;h3 id='before_sending_me_a_cv'&gt;Before sending me a CV&lt;/h3&gt;&lt;ol&gt;&lt;li&gt;&lt;strong&gt;Speak to your candidate in person&lt;/strong&gt; or at least on the phone. Are they blagging? Can they speak clear, fluent, confident English?&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Confirm that the candidate will relocate&lt;/strong&gt; (if remote working isn&amp;#8217;t an option) or that their commute is manageable.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Why should we be excited about the candidate?&lt;/strong&gt; Why are they right for us?&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Check the desired salary/rate&lt;/strong&gt; and make sure the candidate is worth it!&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Ensure the candidate meets all the requirements&lt;/strong&gt; of the job spec, not just &amp;#8220;Ruby&amp;#8221;.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Is the candidate a good fit&lt;/strong&gt; for our culture and work environment?&lt;/li&gt;&lt;/ol&gt;&lt;h3 id='before_the_interview'&gt;Before the interview&lt;/h3&gt;&lt;ol&gt;&lt;li&gt;&lt;strong&gt;Confirm the location&lt;/strong&gt; for your candidate&amp;#8217;s interview. We&amp;#8217;re not in central London so don&amp;#8217;t assume!&lt;/li&gt;&lt;li&gt;&lt;strong&gt;What are the interviewers&amp;#8217; names and positions?&lt;/strong&gt; Who will the successful candidate report to?&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Inform the candidate about the interview process&lt;/strong&gt; and if a test is required.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Get the candidate excited about us!&lt;/strong&gt; Sell us to them and make sure they&amp;#8217;ve done their research.&lt;/li&gt;&lt;/ol&gt;&lt;h3 id='dont_hassle_our_staff'&gt;Don&amp;#8217;t hassle our staff&lt;/h3&gt;&lt;p&gt;This shouldn&amp;#8217;t need saying. Rudeness and (in one case) being threatening and abusive on the phone to one of our staff earns you an instant blacklist.&lt;/p&gt;&lt;h2 id='candidates'&gt;Candidates&lt;/h2&gt;&lt;p&gt;I&amp;#8217;ve had some frustrating candidates too. From sloppy, misspelt, incomprehensible CVs to a lack of preparation and passion at interviews. One candidate admitted they had no interest in the company and just wanted to be left alone to write Ruby! He didn&amp;#8217;t get the job.&lt;/p&gt;&lt;p&gt;How can you stand out from a pile of CVs and impress in an interview? Here are my essentials.&lt;/p&gt;&lt;h3 id='applying_for_a_job'&gt;Applying for a job&lt;/h3&gt;&lt;ol&gt;&lt;li&gt;&lt;strong&gt;Save your CV in PDF format and limit it to three pages&lt;/strong&gt;. I will skip past any other pages. Keep work experience to relevant jobs in the same industry, not working in your local pub.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Present your CV clearly&lt;/strong&gt;. Use a CV template if your software has one. Please don&amp;#8217;t use tiny font sizes to cram more text in. Use whitespace and lines.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Spell and grammar check your CV&lt;/strong&gt; and also get someone else to proof-read it. I care about this even if you don&amp;#8217;t. Get the company name right!&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Write a simple cover email&lt;/strong&gt; briefly detailing why you&amp;#8217;re interested and try to show the personality behind the CV.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Developers: put examples of your code on GitHub&lt;/strong&gt;. I want to see your coding style so anything you can show is better than nothing.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Desginers: I expect to see a portfolio&lt;/strong&gt; of your recent, relevant work. Indicate your level of involvement if you choose to include commercial work. Can I easily see what you&amp;#8217;ve done yourself?&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Be Google-able!&lt;/strong&gt; I&amp;#8217;m baffled that anyone working in this industry can escape the Googlebot&amp;#8217;s spidering. Tweet, blog or take photos and use your real name (or quote your screen name in your email).&lt;/li&gt;&lt;/ol&gt;&lt;h3 id='before_your_interview'&gt;Before your interview&lt;/h3&gt;&lt;ol&gt;&lt;li&gt;&lt;strong&gt;Research the company&lt;/strong&gt;. Do your homework on us. What do we do? Who are our key clients? Read through our website.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Find out who is interviewing you&lt;/strong&gt;. Ask and then Google them to find out a few useful facts. Gain the upper hand.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;What makes you stand out?&lt;/strong&gt; Think of five (positive) things your colleagues would say about you.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Prepare some questions to ask us&lt;/strong&gt;. What&amp;#8217;s important that you want to find out?&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Bring a few copies of your latest CV&lt;/strong&gt;. Hopefully your recruiter will have sent your latest version, but from experience this can&amp;#8217;t be guaranteed.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Arrive a little early&lt;/strong&gt;. Your interviewers are busy people and their time is short. This is why they&amp;#8217;re hiring. Don&amp;#8217;t be the late guy/girl.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Always wear a suit&lt;/strong&gt;, even if you know your interviewers will be in t-shirts and jeans, unless you&amp;#8217;re told otherwise. This is a job interview. Tie is optional.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Make eye contact, firm handshake, smile!&lt;/strong&gt; First impressions absolutely do count.&lt;/li&gt;&lt;/ol&gt;&lt;h2 id='employers'&gt;Employers&lt;/h2&gt;&lt;p&gt;I slot in recruitment alongside my other work, but even though it can easily consume hours, I want to spend the time researching, testing and interviewing candidates thoroughly. A bad hire can be disastrous to team harmony and motivation.&lt;/p&gt;&lt;p&gt;Here&amp;#8217;s my side of the bargain:&lt;/p&gt;&lt;ol&gt;&lt;li&gt;&lt;strong&gt;I will read your whole CV&lt;/strong&gt; &amp;#8211; providing it&amp;#8217;s no more than three pages. I want to see recent work history (dates, company names, URLs), technologies you&amp;#8217;ve worked with and education including dates. A well-designed CV always stands out.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;I will spend time researching you&lt;/strong&gt;. See above &amp;#8211; make sure there&amp;#8217;s something for me to Google.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;If you&amp;#8217;re not successful I will send you a rejection email&lt;/strong&gt;. Not all companies take the time to do this, but if you&amp;#8217;ve taken the time to apply you deserve a response.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Your interview will be relaxed and informal&lt;/strong&gt;. I want to see you shine and demonstrate your passion. It&amp;#8217;s not for me to grill you or catch you out.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;You&amp;#8217;ll speak to members of the team who you&amp;#8217;ll be working with&lt;/strong&gt; and you&amp;#8217;ll be shown around the office where you would sit.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;I will get back to you with feedback straight away&lt;/strong&gt;. I don&amp;#8217;t like making candidates sweat or worry.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;If there&amp;#8217;s anything you&amp;#8217;ve forgotten afterwards, phone/email and ask&lt;/strong&gt;. The interview is not the end.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;We&amp;#8217;ll get excited!&lt;/strong&gt; A new member of the team is a big deal so if you&amp;#8217;re successful we&amp;#8217;ll give you a warm welcome.&lt;/li&gt;&lt;/ol&gt;&lt;p&gt;And of course, ahem, I&amp;#8217;m hiring for developers, engineers and testers at &lt;a href='http://globaldev.co.uk/'&gt;globaldev&lt;/a&gt; so have a look at &lt;a href='http://globaldev.co.uk/jobs'&gt;our jobs page&lt;/a&gt; and get in touch.&lt;/p&gt;"
   }
   ,
 
   {
     "id": "/get-your-eyes-lasered",
     "title": "Get your eyes lasered",
     "url": "http://barryfrost.com/articles/get-your-eyes-lasered",
     "posted": "2011-05-02T20:43:16+01:00",
     "summary": "I was a contact lens/glasses wearer for over 16 years before finally undertaking laser eye surgery in December last year....",
     "body": "&lt;p&gt;I was a contact lens/glasses wearer for over 16 years before finally undertaking laser eye surgery in December last year. I had toyed with the idea for a while and finally went for it. I&amp;#8217;m thoroughly pleased with the end results and wish I had gone for it sooner. What follows are my own experiences and thoughts which may be valuable if you&amp;#8217;re considering laser eye surgery too.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Quick disclaimer: I&amp;#8217;m clearly not a qualified expert. Speak to a professional. Your mileage may vary.&lt;/strong&gt;&lt;/p&gt;&lt;h2 id='apprehension'&gt;Apprehension&lt;/h2&gt;&lt;p&gt;I had heard about the risks. You could go blind. They fire scary lasers into your eyes. It hurt. After many years of placing little bits of plastic onto my eyes almost every day I wasn&amp;#8217;t squeamish, but I would be lying if I said I wasn&amp;#8217;t intimidated by the procedure.&lt;/p&gt;&lt;p&gt;I also knew that laser eye surgery may not result in perfect, &lt;a href='http://www.tlcvision.com/tiger-woods-lasik/'&gt;Tiger Woods&lt;/a&gt; level &lt;a href='http://en.wikipedia.org/wiki/20/20_vision'&gt;20/20&lt;/a&gt; vision and that there was a risk of poor night vision among other side effects. The risk of going through the pain and stress and still needing to wear contact lenses or glasses was offputting.&lt;/p&gt;&lt;p&gt;And of course, despite the advertisements quoting prices of (from) £395 per eye, I was sceptical and believed the cost to be around at least twice that. The risks of blindness and of spending such a large amount of money and it not being wholly satisfactory meant it was easy to dismiss the idea.&lt;/p&gt;&lt;h2 id='decision'&gt;Decision&lt;/h2&gt;&lt;p&gt;I&amp;#8217;d love to say there was a life-changing moment which pushed me into finding out more. In reality, it was the increasing discomfort from wearing contact lenses all day. My eyes were often sore in the evening and getting worse from staring at computer screens in an air-conditioned office. Nights out ended in blinking Barry trying to get moisture from tears to lubricate my contact lenses.&lt;/p&gt;&lt;p&gt;So I did some research. I thankfully didn&amp;#8217;t trawl YouTube to find horror videos of surgery (don&amp;#8217;t do it), but I did enough simple Google searching and reading to be satisfied that success rates and satisfaction was high. Laser eye surgery is now wholly normal and mainstream.&lt;/p&gt;&lt;p&gt;I searched for reputable companies near me, including Optimax, Ultralase and &lt;a href='http://www.opticalexpress.co.uk/laser-eye-surgery.html'&gt;Optical Express&lt;/a&gt;, and picked the latter. It looked professional from the website and it was nearest me. Don&amp;#8217;t underestimate closeness as a factor: you will need to make a number of visits for pre and post check-ups.&lt;/p&gt;&lt;h2 id='consultation'&gt;Consultation&lt;/h2&gt;&lt;p&gt;I booked a visit to Optical Express in High Wycombe on 9 October 2010. First impressions were that it seemed professional and the clinic appeared smart and clean. This was important to me. I really didn&amp;#8217;t want to be seen or operated on in the back room of shabby side-street shop.&lt;/p&gt;&lt;p&gt;I was short-sighted and so my long distance vision was poor. My prescription was approximately -3.5 in each eye. This was fine for the procedure and with a relatively low prescription, I had a lower risk of night vision glare or haloing.&lt;/p&gt;&lt;p&gt;The optometrist was convincing. After a series of questions and measurements, including anaesthitising my eye and probing it to measure the thickness of my cornea, her recommendation was for standard &lt;a href='http://www.opticalexpress.co.uk/laser-eye-surgery/intralase.html'&gt;Intralase LASIK&lt;/a&gt;. She explained that with Intralase a second laser is used to cut a thin flap in the cornea rather than require a surgeon to use a blade.&lt;/p&gt;&lt;p&gt;The alternative method we discussed was &lt;a href='http://en.wikipedia.org/wiki/Photorefractive_keratectomy'&gt;LASEK&lt;/a&gt;: instead of a flap, a thin layer is removed from the eye&amp;#8217;s surface. I was told this requires a much longer recovery time (up to a week) and is significantly more painful. I rejected this fairly quickly. I wanted to go for the best option recommended to me with the least pain and discomfort.&lt;/p&gt;&lt;p&gt;Among other warnings and precautions I was given, she stressed the fact that old-age long-sightedness will still affect me and may even begin slightly earlier.&lt;/p&gt;&lt;p&gt;Leaving the surgery I was given my quote. Total cost, including eye drops and check-ups, was £2,400. More than I thought, but reasonable.&lt;/p&gt;&lt;p&gt;Thinking back, maybe I could have asked for a discount or haggled in some way &amp;#8211; the optometrist&amp;#8217;s sales technique was fairly sharp and I&amp;#8217;m sure they work on margin &amp;#8211; but I feared some sort of lower quality or reduced service. Ridiculous, I know.&lt;/p&gt;&lt;p&gt;I went home to discuss with my other half, Laura, and think about it. It didn&amp;#8217;t take long to decide.&lt;/p&gt;&lt;p&gt;After the consultation you get gently chased to make your decision. I didn&amp;#8217;t have any further questions or reason to prevaricate any longer and so the following week, gulping, I paid my deposit.&lt;/p&gt;&lt;h2 id='presurgery'&gt;Pre-surgery&lt;/h2&gt;&lt;img title='FML: Fuck My Life' src='http://dl.dropbox.com/u/207451/blog/fml.jpg' alt='FML bottle' style='float: right; margin: 0 0 10px 10px;' /&gt;&lt;p&gt;I initially booked my surgery for 13 November 2010 and was told to stop wearing contact lenses on 24 October to give my eyes time to breathe. I was told my eyes were quite dry during the consultation. This wasn&amp;#8217;t a surprise to me, but the optometrist insisted that the dryness would need to clear up before surgery.&lt;/p&gt;&lt;p&gt;This meant using eye drops and returning to wearing glasses for the first time since secondary school. Few work colleagues or friends even knew I was short-sighted. I could handle putting in drops every few hours, but hated wearing glasses again. I overcame my childish vanity by reminding myself I would only have to endure glasses for a couple of weeks.&lt;/p&gt;&lt;p&gt;In fact, my surgery was rescheduled three times. My eyes were just too dry to proceed and so I was given a series of new drops to try, including the fabulously-named FML (see photo, right).&lt;/p&gt;&lt;p&gt;The delays were frustrating, but I wasn&amp;#8217;t going to argue with the optometrist if she thought surgery was too risky while my eyes were dry. Patience.&lt;/p&gt;&lt;h2 id='surgery'&gt;Surgery&lt;/h2&gt;&lt;p&gt;I finally got the go-ahead to book surgery for 18 December, a Saturday, at Optical Express&amp;#8217;s Harley Street clinic. After surgery someone needs to help you get home and I was told you need 48 hours recovery time afterwards. I booked the Monday off work to be safe.&lt;/p&gt;&lt;p&gt;Booking a clinic located on &lt;a href='http://en.wikipedia.org/wiki/Harley_Street'&gt;Harley Street&lt;/a&gt; (famous in London for private surgeries and specialists) was reassuring, even though it was theoretically the same as any other OE centre.&lt;/p&gt;&lt;p&gt;My day of surgery was in the middle of a period of heavy snow in London. My car needed to be pushed off ice on the way to park near the station, trains were cancelled and we wondered whether we would even be able to get back home after. Not the best preparation, but the saga helped occupy my mind. We were on time.&lt;/p&gt;&lt;p&gt;After a short wait and a couple of pre-checks with the surgeon, Mr Manek Patel, I was brought into the theatre. I was laid down, my eyes were aneasthetised and I waited for him to return. My heart was racing as you might expect.&lt;/p&gt;&lt;p&gt;And then the procedure began. One eye at a time. Suction clamps were put on my eye to stop it moving, my vision went grey, the intralase laser fired, ptt-ptt-ptt, surgeon folded flap back, I&amp;#8217;m moved to the next machine, suction, corrective laser fires, ptt-ptt-ptt, flap put back, antibiotic drops, vision returns. Next eye. Repeat.&lt;/p&gt;&lt;p&gt;It was all over in minutes. Even though the suction clamps stop your eyes moving, I&amp;#8217;ve never held myself so still! You feel nothing at all, although there is a smell of burning as the laser reshapes each lens.&lt;/p&gt;&lt;p&gt;I was moved to a darkened waiting room and told my eyes would weep a bit. Carefully testing my eyes out I convinced myself I could see distance correctly. Then I shut them again. A few minutes of recovery and then I could leave &amp;#8211; with sunglasses to protect my light-sensitive eyes.&lt;/p&gt;&lt;h2 id='postsurgery'&gt;Post-surgery&lt;/h2&gt;&lt;p&gt;The journey home wasn&amp;#8217;t fun, but not for surgery-related reasons. You&amp;#8217;re encouraged to return home as soon as possible and sleep for a few hours. The snow meant we couldn&amp;#8217;t find a taxi, trains were sporadic and then no taxis at Windsor. Trudging through the snow when you&amp;#8217;re half blind and disorientated isn&amp;#8217;t fun. Thankfully I had Laura&amp;#8217;s help.&lt;/p&gt;&lt;p&gt;Back home, I put on my new goggles, intended to prevent you knocking your eyes accidentally. I wore these for the first week in bed at night, much to Laura&amp;#8217;s amusement. You&amp;#8217;re also given milky steroid and antibiotic drops to put in 6 times a day. No pain or real discomfort, although I took Ibuprofen for the first couple of days to be sure.&lt;/p&gt;&lt;p&gt;The day after surgery I had the required 24-hour check-up. All was healing well and I apparently had better than 20/20 vision! I could even drive home if I wanted (I didn&amp;#8217;t). Gingerly using my eyes over the Sunday and Monday I then returned to work. Computer displays were a bit bright, but otherwise I could see normally. Driving at night was also fine.&lt;/p&gt;&lt;p&gt;In my first week, I found that my vision over distance was at least as good as with contacts and glasses previously, probably better. No discomfort or pain. Initial sensitivity to light went quickly too.&lt;/p&gt;&lt;p&gt;Encouraged, a week later I returned for my one-week check-up. My eyes were a little worse than after a day. I was told this was normal. There was a slight inflammation in one eye and they were both dry. I continued using the drops.&lt;/p&gt;&lt;p&gt;A further week later the inflamation had cleared up and all was fine, apart from a little dryness. I kept using standard &amp;#8220;blink&amp;#8221; eye drops a few times a day for two further weeks. I still use them for comfort occasionally, although I could live without them.&lt;/p&gt;&lt;p&gt;Approximately six months later my vision is great, even at night. I&amp;#8217;ll return regularly for check-ups to look for any long-term changes.&lt;/p&gt;&lt;h2 id='conclusion'&gt;Conclusion&lt;/h2&gt;&lt;p&gt;I&amp;#8217;m very pleased with the results from the surgery. I wish I&amp;#8217;d done it sooner. Yes, there&amp;#8217;s a lot of upheaval, drops, glasses-wearing, check-ups and expense, but I think it was worth it. Waking up in the morning, opening your eyes and seeing perfectly still makes me smile.&lt;/p&gt;&lt;p&gt;The total cost is expensive, but you can pay in installments if that helps. I was paying £360/year in daily disposable contacts plus more in glasses so I estimate it will take five years to cover the cost. That doesn&amp;#8217;t take in account the time-saving and convenience every morning and night.&lt;/p&gt;&lt;p&gt;If you&amp;#8217;re considering it, speak to a professional and if it&amp;#8217;s right for you, go for it. Really. Don&amp;#8217;t put it off. I&amp;#8217;d be happy to answer any questions you might have: &lt;a href='http://twitter.com/barryf'&gt;ping me on Twitter&lt;/a&gt;.&lt;/p&gt;"
   }
   ,
 
   {
     "id": "/sinatra-and-heroku-tips",
     "title": "Sinatra and Heroku tips",
     "url": "http://barryfrost.com/articles/sinatra-and-heroku-tips",
     "posted": "2011-04-19T21:04:00+01:00",
     "summary": "While building this site I read several useful articles that promoted best practices for Sinatra and Heroku. What follows are...",
     "body": "&lt;p&gt;While &lt;a href='/articles/a-new-start'&gt;building this site&lt;/a&gt; I read several useful articles that promoted best practices for &lt;a href='http://sinatrarb.com/'&gt;Sinatra&lt;/a&gt; and &lt;a href='http://www.heroku.com/'&gt;Heroku&lt;/a&gt;. What follows are fairly raw tips and code snippets that I found useful and might be handy for you.&lt;/p&gt;&lt;h2 id='use_bundler_for_your_gems'&gt;Use Bundler for your gems&lt;/h2&gt;&lt;p&gt;Some of the older Heroku documentation suggests using a &lt;code&gt;.gems&lt;/code&gt; file. At the time of writing, best practice is to &lt;a href='http://devcenter.heroku.com/articles/bundler'&gt;use Bundler&lt;/a&gt;:&lt;/p&gt;&lt;pre&gt;&lt;code&gt;$ sudo gem install bundler&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;Create a file called &lt;code&gt;Gemfile&lt;/code&gt; in your application root:&lt;/p&gt;&lt;pre&gt;&lt;code&gt;source :gemcuttergem &amp;#39;sinatra&amp;#39;# add any other gems you need here&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;Then run:&lt;/p&gt;&lt;pre&gt;&lt;code&gt;$ bundle install&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;Don&amp;#8217;t forget to add the &lt;code&gt;Gemfile&lt;/code&gt; and &lt;code&gt;Gemfile.lock&lt;/code&gt; to your repo:&lt;/p&gt;&lt;pre&gt;&lt;code&gt;$ git add Gemfile Gemfile.lock$ git commit -m &amp;quot;Adding Gemfile and Gemfile.lock for Bundler.&amp;quot;&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;When you come to deploy your application Heroku will pick these files up and install any dependencies your application needs. Magic.&lt;/p&gt;&lt;p&gt;Further information is in the &lt;a href='http://devcenter.heroku.com/articles/bundler'&gt;Heroku Bundler article&lt;/a&gt;.&lt;/p&gt;&lt;h2 id='use_memcached_to_store_page_content'&gt;Use memcached to store page content&lt;/h2&gt;&lt;p&gt;In your &lt;code&gt;configure&lt;/code&gt; block add the following:&lt;/p&gt;&lt;pre&gt;&lt;code&gt;configure do  ...  require &amp;#39;memcached&amp;#39;  CACHE = Memcached.new  ...end&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;Then in actions where you want to save the content:&lt;/p&gt;&lt;pre&gt;&lt;code&gt;get &amp;#39;/&amp;#39; do  begin    content = CACHE.get(&amp;quot;home&amp;quot;)  rescue Memcached::NotFound    content = erb(:home)    CACHE.set(&amp;quot;home&amp;quot;, content)  end  contentend&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;You&amp;#8217;ll need to make sure you have a local Memcached instance running while developing. I leave this running in a Terminal window via &lt;code&gt;memcached -vv&lt;/code&gt; to get verbose debugging output.&lt;/p&gt;&lt;h2 id='use_herokus_varnish_caching'&gt;Use Heroku&amp;#8217;s Varnish caching&lt;/h2&gt;&lt;p&gt;Heroku includes a built-in server-side page cache. If you set HTTP headers in your response then Varnish will do the rest. I&amp;#8217;ve set up a simple helper for this:&lt;/p&gt;&lt;pre&gt;&lt;code&gt;helpers do  ...  def cache_for(mins = 1)    if settings.environment != :development      response[&amp;#39;Cache-Control&amp;#39;] = &amp;quot;public, max-age=#{60*mins}&amp;quot;    end  end  ...end&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;Because browsers also pick up on these cache directives you get the double benefit of your visitors&amp;#8217; browsers caching pages, plus the server.&lt;/p&gt;&lt;p&gt;I don&amp;#8217;t want the caching to kick in when developing, however, so only do this when not in development mode.&lt;/p&gt;&lt;h2 id='escape_variables_output_in_html'&gt;Escape variables output in HTML&lt;/h2&gt;&lt;p&gt;When outputting content, especially anything entered by a user, it&amp;#8217;s best to escape it to prevent malicious users stealing cookies or other bad behaviour. In your controller, include the following in your &lt;code&gt;helpers&lt;/code&gt; block:&lt;/p&gt;&lt;pre&gt;&lt;code&gt;helpers do  ...  include Rack::Utils  alias_method :h, :escape_html  ...end&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;Then, in your view, you can escape any variable as follows:&lt;/p&gt;&lt;pre&gt;&lt;code&gt;&amp;lt;p&amp;gt;&amp;lt;%= h @my_potentially_naughty_variable %&amp;gt;&amp;lt;/p&amp;gt;&lt;/code&gt;&lt;/pre&gt;&lt;h2 id='use_utf8'&gt;Use UTF-8&lt;/h2&gt;&lt;p&gt;You want to use UTF-8 right?&lt;/p&gt;&lt;blockquote&gt;&lt;p&gt;Save your pages as UTF-8, whenever you can.&lt;/p&gt;&lt;/blockquote&gt;&lt;p&gt;&amp;#8211;&lt;a href='http://www.w3.org/International/tutorials/tutorial-char-enc/'&gt;W3C Internationalization tutorial&lt;/a&gt;&lt;/p&gt;&lt;p&gt;Add this &lt;code&gt;before&lt;/code&gt; block and forget about it:&lt;/p&gt;&lt;pre&gt;&lt;code&gt;before do  ...  headers &amp;quot;Content-Type&amp;quot; =&amp;gt; &amp;quot;text/html; charset=utf-8&amp;quot;  ...end&lt;/code&gt;&lt;/pre&gt;&lt;h2 id='miscellany'&gt;Miscellany&lt;/h2&gt;&lt;p&gt;Other useful things I found:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;In Ruby, if you want to use a substring, you can simply treat a string as an array (almost everything&amp;#8217;s an object). So, for example, &lt;code&gt;&amp;quot;Barry Frost&amp;quot;[0..4]&lt;/code&gt; == &lt;code&gt;&amp;quot;Barry&amp;quot;&lt;/code&gt;&lt;/li&gt;&lt;li&gt;Learn to use the ternary operator. Code becomes much more readable as a result, e.g. &lt;code&gt;content = @items.length &amp;gt; 0 ? erb(:index, :layout =&amp;gt; !request.xhr?) : &amp;#39;&amp;#39;&lt;/code&gt;&lt;/li&gt;&lt;li&gt;Having &lt;code&gt;irb&lt;/code&gt; to hand to try out code without a compile/page reload cycle is so refreshing. Try out and debug regular expressions before writing any code.&lt;/li&gt;&lt;/ul&gt;"
   }
   ,
 
   {
     "id": "/a-new-start",
     "title": "A new start",
     "url": "http://barryfrost.com/articles/a-new-start",
     "posted": "2011-04-18T22:41:00+01:00",
     "summary": "Earlier this year, back in January in fact, I had a few nagging aims/resolutions on my to-do list. I wanted...",
     "body": "&lt;p&gt;Earlier this year, back in January in fact, I had a few nagging aims/resolutions on my to-do list. I wanted to:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Improve my rusty and weak Ruby&lt;/li&gt;&lt;li&gt;Migrate from Subversion to git and put some code up on &lt;a href='http://github.com/barryf'&gt;GitHub&lt;/a&gt;&lt;/li&gt;&lt;li&gt;Try out &lt;a href='http://sinatrarb.com/'&gt;Sinatra&lt;/a&gt;, a lightweight Ruby web framework built on &lt;a href='http://rack.rubyforge.org/'&gt;Rack&lt;/a&gt;&lt;/li&gt;&lt;li&gt;Investigate &lt;a href='http://www.heroku.com/'&gt;Heroku&lt;/a&gt; for hosting something in Ruby&lt;/li&gt;&lt;li&gt;Get blogging! For the occasions when I have something to share&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Meanwhile my personal website had become rather clunky, outdated and in dire need of a refresh.&lt;/p&gt;&lt;blockquote&gt;&lt;p&gt;What made it click for me was programming in anger. &amp;#8230; When you’re learning on a mission, the order of things come really naturally.&lt;/p&gt;&lt;/blockquote&gt;&lt;p&gt;&amp;#8211;&lt;a href='http://37signals.com/svn/posts/2582-how-do-i-learn-to-program'&gt;David Heinemeier Hansson, 37signals&lt;/a&gt;&lt;/p&gt;&lt;p&gt;As DHH wrote, the best way to learn a programming language or technology is to build something real. So I set about killing multiple birds with one stone by learning and experimenting while dragging my website into the two-thousand-and-tens.&lt;/p&gt;&lt;p&gt;This website is the end result. Here&amp;#8217;s a screenshot from the new homepage, captured as I write this:&lt;/p&gt;&lt;p&gt;&lt;img src='http://dl.dropbox.com/u/207451/Screenshots/barryfrost.com_redesign_apr_2011.png' alt='April 2011 screenshot of barryfrost.com' /&gt;&lt;/p&gt;&lt;h2 id='design_and_concept'&gt;Design and concept&lt;/h2&gt;&lt;p&gt;Back before &lt;a href='http://techcrunch.com/2009/08/10/facebook-acquires-friendfeed/'&gt;FriendFeed was gobbled up by Facebook&lt;/a&gt;, lifestream services were &lt;a href='http://techcrunch.com/2008/03/10/watch-out-friendfeed-socialthing-is-even-easier-to-use/'&gt;hot&lt;/a&gt;. I&amp;#8217;ve used Twitter, Delicious, Last.fm, Flickr and others for several years and there&amp;#8217;s a lot of content and attention data I&amp;#8217;ve accumulated with third parties. I wanted to aggregate my decentralised data into a chronological stream on my own site, as much for my own interest as a potentially useful collection for visitors inexplicably interested in what I do.&lt;/p&gt;&lt;p&gt;A while ago I knocked up a few designs for a stream with indenting and colour-coding for each service. I quite like this as a concept. Tweaking my prototypes a bit, I formed the central theme for the redesign. Articles would also be pulled in and listed via this &amp;#8220;hub&amp;#8221;.&lt;/p&gt;&lt;p&gt;I used the redesign as a good opportunity to play with web fonts &amp;#8211; &lt;a href='http://typekit.com/fonts/lft-etica-web'&gt;LFT Etica Web&lt;/a&gt; through &lt;a href='http://typekit.com/'&gt;Typekit&lt;/a&gt; &amp;#8211; and HTML5 markup (e.g. &lt;code&gt;&amp;lt;header&amp;gt;&lt;/code&gt;, &lt;code&gt;&amp;lt;footer&amp;gt;&lt;/code&gt; and &lt;code&gt;&amp;lt;article&amp;gt;&lt;/code&gt; tags) and some new-to-me CSS in terms of text shadows and &lt;code&gt;position: fixed&lt;/code&gt; elements.&lt;/p&gt;&lt;p&gt;I&amp;#8217;ve also experimented with &lt;a href='http://mediaqueri.es/'&gt;media queries&lt;/a&gt; so that when the page is resized or displayed on small screens the layout and content adjusts via CSS.&lt;/p&gt;&lt;h2 id='hosting_with_heroku'&gt;Hosting with Heroku&lt;/h2&gt;&lt;p&gt;I&amp;#8217;m hosting everything with &lt;a href='http://www.heroku.com/'&gt;Heroku&lt;/a&gt;, a ridiculously simple Ruby hosting platform that&amp;#8217;s built on top of Amazon&amp;#8217;s infrastructure. Deploying is simply a matter of a &lt;code&gt;git push heroku master&lt;/code&gt; and you&amp;#8217;re given a wealth of &lt;a href='http://addons.heroku.com/'&gt;add-on services&lt;/a&gt; to choose from that require zero-setup.&lt;/p&gt;&lt;p&gt;I&amp;#8217;m using PostgreSQL to store my stream data and sort by date/source, although you can also use Redis, CouchDB and other popular nosql engines with Heroku if you only need key/value pairs. MySQL isn&amp;#8217;t available, but that&amp;#8217;s not a big problem for a greenfield project like this and it&amp;#8217;s fun to be using the very able PostgreSQL RDBMS again.&lt;/p&gt;&lt;p&gt;Whole page content variables are cached with the built-in Memcached store for performance and I&amp;#8217;m also making thorough use of cache-control headers which are picked up by Heroku&amp;#8217;s Varnish layer and also client browsers. If I&amp;#8217;m ever lucky enough to be Fireballed, Slashdotted, Reditted or HackerNews&amp;#8217;d I&amp;#8217;ve got multiple layers of caching protection for almost no effort.&lt;/p&gt;&lt;h2 id='blogging_with_jekyll'&gt;Blogging with Jekyll&lt;/h2&gt;&lt;p&gt;I wanted to start a blog. I knew that I wouldn&amp;#8217;t go from never blogging to become prolific, but for the rare occasions when I do have something to share, I wanted an outlet.&lt;/p&gt;&lt;p&gt;Initially I flirted with the idea of using a hosted blog system like Wordpress, Tumblr or Posterous but this seemed overkill. As a sometime hacker I wanted something I could tinker with and that I could host with the main site on Heroku. Using a separate domain (or subdomain) with an external service felt unnecessarily messy.&lt;/p&gt;&lt;p&gt;Searching around I (re)read &lt;a href='http://tom.preston-werner.com/'&gt;Tom Preston-Werner&lt;/a&gt;&amp;#8217;s &lt;a href='http://tom.preston-werner.com/2008/11/17/blogging-like-a-hacker.html'&gt;Blogging Like a Hacker&lt;/a&gt; post which describes his desire for a lo-fi solution that resulted in &lt;a href='http://github.com/mojombo/jekyll'&gt;Jekyll&lt;/a&gt;. Bingo. Jekyll means I can write articles in &lt;a href='http://simplenoteapp.com/'&gt;Simplenote&lt;/a&gt; or Textmate in &lt;a href='http://daringfireball.net/projects/markdown/'&gt;Markdown&lt;/a&gt;, run them through the Jekyll server which generates simple static HTML files and an Atom feed. I then deploy all these via Git to my site and Sinatra serves them up.&lt;/p&gt;&lt;h2 id='stream_in_ruby'&gt;Stream in Ruby&lt;/h2&gt;&lt;p&gt;The Sinatra app is &lt;a href='http://github.com/barryf/barryfrost.com'&gt;fairly simple&lt;/a&gt;: a collection of fetchers pull down JSON feeds from each of the services and insert new items into a table. The results are pulled out and aggregated into the stream.&lt;/p&gt;&lt;p&gt;For tweets in the stream, I&amp;#8217;ve linked up usernames, links and hashtags. Any links with redirects that have been shortened are followed to get the canonical URL. Plus all links are sent to &lt;a href='http://oohembed.com/'&gt;oohEmbed&lt;/a&gt; to see if they support oEmbed and there&amp;#8217;s a thumbnail to display, for example with &lt;a href='http://twitpic.com/'&gt;Twitpic&lt;/a&gt; images.&lt;/p&gt;&lt;h2 id='whats_left'&gt;What&amp;#8217;s left&lt;/h2&gt;&lt;p&gt;I&amp;#8217;ve brushed up on Ruby, but I neglected to spend any time on tests. Naughty Barry. Rather than go back and retrospectively add them, I&amp;#8217;ll set myself a new project to apply good TDD principles.&lt;/p&gt;&lt;p&gt;You can find all the code in my &lt;a href='http://github.com/barryf/barryfrost.com'&gt;repo on GitHub&lt;/a&gt;. Feel free to poke around and fork but please don&amp;#8217;t steal my design or stylesheets.&lt;/p&gt;"
   }
   
 
]
